In [3]:
import pandas as pd
import numpy as np

In [4]:
dict = {
    "name": ['Prince', 'Jeet','HariOm','Aditya','Rajveer'],
    "Marks": [9 , 10, 12, 12, 9,],
    "City": ['Sonpur', 'Patna','Ara','Siwan','Chhapra',]
}

In [5]:
df = pd.DataFrame(dict)

In [6]:
df

      name  Marks     City
0   Prince      9   Sonpur
1     Jeet     10    Patna
2   HariOm     12      Ara
3   Aditya     12    Siwan
4  Rajveer      9  Chhapra

In [7]:
df.to_csv("Data.csv")

In [8]:
df.to_csv("Data.csv", index=False)

In [9]:
data = pd.read_csv("Data.csv")

In [10]:
data

      name  Marks     City
0   Prince      9   Sonpur
1     Jeet     10    Patna
2   HariOm     12      Ara
3   Aditya     12    Siwan
4  Rajveer      9  Chhapra

In [11]:
data.index = ['first','second','third','fourth','fifth']

In [12]:
data

           name  Marks     City
first    Prince      9   Sonpur
second     Jeet     10    Patna
third    HariOm     12      Ara
fourth   Aditya     12    Siwan
fifth   Rajveer      9  Chhapra

In [13]:
data['Marks']['first'] = 100

C:\Users\princ\AppData\Local\Temp\ipykernel_22364\1952549135.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  data['Marks']['first'] = 100
C:\Users\princ\AppData\Local\Temp\ipykernel_22364\1952549135.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['Marks']['first'] = 100

In [14]:
data

           name  Marks     City
first    Prince    100   Sonpur
second     Jeet     10    Patna
third    HariOm     12      Ara
fourth   Aditya     12    Siwan
fifth   Rajveer      9  Chhapra

In [22]:
data.to_csv("Data2.csv")